#-----------------------------------------------------------
# 제어 구문
# if : 조건에 따라 명령의 실행 여부를 결정 !!
# true, false 의 조건을 묻는 경우 !!
#-----------------------------------------------------------
#if 조건 :
#    true 실행 코드

#a = int(input('입력 : '))
#if a :
#    print('true')
#-----------------------------------------------------------
# 블럭 구조
# --> 들여쓰기가 같은 단계끼리 블럭을 형성
# --> if, for, 함수, 클래스 ...
#-----------------------------------------------------------
age = 24

if age < 20:
    print("미성년자는 10시 이후에 공부....")
else :
    print("나이먹었으면 자라...")
    print("!!!")
print("종료 합니다")

#-----------------------------------------------------------
# elif
# --> C, JAVA if else if else ~~
# --> if else의 조건이 만족하지 않을때 세부 조건 추가
#-----------------------------------------------------------

key = input('명령 : ')

if key == 'w' or 'ㅈ':
    print('발차기')
elif key == 'a' or 'ㅁ':
    print('점프')
elif key == 's' or 'ㄴ':
    print('달리기')
else :
    print('')
#-----------------------------------------------------------
# 사용자에게 성적을 입력받아 학점 출력
# 입력 : 81 출력 : B
# 91 ~ 100 : A / 81 ~ 90 : B / 71 ~ 80 : C / else : F
score = int(input("점수를 입력하세요 : "))

if score <= 100 and score >= 91:
    print("A")
elif score <= 90 and score >= 81:
    print("B")
elif score <= 80 and score >= 71:
    print("C")
else:
    print("F")
#-----------------------------------------------------------
# w W : 앞 a A : 좌 s S : 뒤 d D : 우 = : 계속 달리기

key = input('명령 : ')

if key == 'w' or 'W':
    print('앞')
elif key == 'a' or 'A':
    print('좌')
elif key == 's' or 'S':
    print('뒤')
elif key == 'd' or 'D':
    print('우')
elif key == '=':
    print('계속 달리기')
else:
    print('종료')
#-----------------------------------------------------------












