#=========================================================
# 파이썬 문자열
# - ""/'' 구분없이 사용
# - class str
# - s[위치] : 해당 위치의 문자 !!
#   0   1   2   3   4
#  [A] [B] [C] [D] [E]
#  -5  -4  -3  -2  -1
#=========================================================
s = 'ABCDE'

print(s)
print(type(s))
print(s[0])
print(s[1])
print(s[2])
print(s[-2])

for c in s:
    print(c, end = '/')

# 슬라이싱 : 문자열 자르기(추출)
print(s[0:1])
#print(s[시작위치 : 끝위치])

#=========================================================
# 문자열 관련 메소드
#=========================================================
s = 'hello phthon GGU !'

print(len(s)) # s의 길이
print(s.find('h')) # 첫번째 h
print(s.rfind('h')) # 뒤에서 첫번째 h
print(s.index('p'))
print(s.count('GGU'))
#=========================================================

alpha = 'ABCDEFGHIJKLMNOPQRSTUVWXYZ'

# 문자열 중에 A 존재하는지 검사
if alpha.count('A') > 0:
    print('A')

if 'Q' not in alpha:
    print('A OK')

ch = '123'
# is ~~~ : true, false
if ch.isalpha():
    print(ch)
if ch.isupper():
    print("S")
if ch.islower():
    print('s')
if ch.isnumeric():
    print('123')

print(alpha.lower())
#=========================================================
# 공백 문자 제거 
# 'aaa' == ' aaa'?
#=========================================================
ss = '  aaa  '
if 'aaa' == ss.strip():
    print('same')

print(ss,'|')
print(ss.lstrip(),'|')
#=========================================================
# split : 구분자를 기준으로 문자열을 분할 !!
#=========================================================
s = '황어준/01011112222/3학년/서울'
stu = s.split('/')
print(type(stu))

for c in stu:
    print(c)

#=========================================================
# join : 문자열의 각문자마다 문자열 끼워 넣기
#=========================================================
s = '\t'
print(s.join('korea'))

#=========================================================
# replace : 문자열을 갈아 치우는 것
#=========================================================
s = '황어준/01011112222/3학년/서울'
print(s.replace('황어준','김용성'))
#=========================================================
# format
#========================================================
price = 500
print("궁금하면 "+ str(price)+'원')# 자바 방식 !!
print("궁금하면 %d원" %price) # C언어 방식 !!














